windTurbineCase_PimpleFoam/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ( "libfvMotionSolvers.so" );

solver          solidBody;

solidBodyCoeffs
{
    cellZone        cylinder;

    solidBodyMotionFunction rotatingMotion;

    rotatingMotionCoeffs
    {
        origin      (0 0 0);
        axis        (0 1 0);
        omega       -25.5;
    }
}